{"resultsPerPage":103,"startIndex":0,"totalResults":103,"format":"NVD_CVE","version":"2.0","timestamp":"2024-01-25T13:12:42.033","vulnerabilities":[{"cve":{"id":"CVE-2024-0804","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:07.720","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Insufficient policy enforcement in iOS Security UI in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to leak cross-origin data via a crafted HTML page. (Chromium security severity: Medium)"},{"lang":"es","value":"La aplicación insuficiente de políticas en iOS Security UI en Google Chrome anterior a 121.0.6167.85 permitió que un atacante remoto filtrara datos de orígenes cruzados a través de una página HTML manipulada. (Severidad de seguridad de Chromium: media)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1515137","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0805","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:07.787","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Inappropriate implementation in Downloads in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to perform domain spoofing via a crafted domain name. (Chromium security severity: Medium)"},{"lang":"es","value":"La implementación inadecuada en Downloads en Google Chrome anterior a 121.0.6167.85 permitió a un atacante remoto realizar una suplantación de dominio a través de un nombre de dominio manipulado. (Severidad de seguridad de Chromium: media)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1514925","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0806","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:07.847","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Use after free in Passwords in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to potentially exploit heap corruption via specific UI interaction. (Chromium security severity: Medium)"},{"lang":"es","value":"Use after free en Passwords en Google Chrome anterior a 121.0.6167.85 permitía a un atacante remoto explotar potencialmente la corrupción del montón a través de una interacción de interfaz de usuario específica. (Severidad de seguridad de Chromium: media)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1505176","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0807","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:07.897","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Use after free in Web Audio in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page. (Chromium security severity: High)"},{"lang":"es","value":"Use after free en Web Audio en Google Chrome anterior a 121.0.6167.85 permitía a un atacante remoto explotar potencialmente la corrupción del montón a través de una página HTML manipulada. (Severidad de seguridad de Chrome: alta)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1505080","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0808","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:07.950","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Integer underflow in WebUI in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to potentially exploit heap corruption via a malicious file. (Chromium security severity: High)"},{"lang":"es","value":"El desbordamiento de enteros en WebUI en Google Chrome anterior a 121.0.6167.85 permitía a un atacante remoto explotar potencialmente la corrupción del montón a través de un archivo malicioso. (Severidad de seguridad de Chrome: alta)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1504936","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0809","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:08.003","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Inappropriate implementation in Autofill in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to bypass Autofill restrictions via a crafted HTML page. (Chromium security severity: Low)"},{"lang":"es","value":"La implementación inapropiada de Autocompletar en Google Chrome anterior a 121.0.6167.85 permitió a un atacante remoto evitar las restricciones de Autocompletar a través de una página HTML manipulada. (Severidad de seguridad de Chrome: baja)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1497985","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0810","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:08.063","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Insufficient policy enforcement in DevTools in Google Chrome prior to 121.0.6167.85 allowed an attacker who convinced a user to install a malicious extension to leak cross-origin data via a crafted Chrome Extension. (Chromium security severity: Medium)"},{"lang":"es","value":"La aplicación insuficiente de políticas en DevTools en Google Chrome antes de 121.0.6167.85 permitió a un atacante que convenció a un usuario de instalar una extensión maliciosa para filtrar datos de orígenes cruzados a través de una extensión de Chrome manipulada. (Severidad de seguridad de Chromium: media)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1496250","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0811","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:08.117","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Inappropriate implementation in Extensions API in Google Chrome prior to 121.0.6167.85 allowed an attacker who convinced a user to install a malicious extension to leak cross-origin data via a crafted Chrome Extension. (Chromium security severity: Low)"},{"lang":"es","value":"La implementación inadecuada en Extensions API en Google Chrome anterior a 121.0.6167.85 permitió a un atacante que convenció a un usuario de instalar una extensión maliciosa para filtrar datos de orígenes cruzados a través de una extensión de Chrome manipulada. (Severidad de seguridad de Chrome: baja)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1494490","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0812","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:08.167","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Inappropriate implementation in Accessibility in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to potentially exploit object corruption via a crafted HTML page. (Chromium security severity: High)"},{"lang":"es","value":"La implementación inadecuada de Accessibility en Google Chrome anterior a 121.0.6167.85 permitía a un atacante remoto explotar potencialmente la corrupción de objetos a través de una página HTML manipulada. (Severidad de seguridad de Chrome: alta)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1484394","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0813","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:08.223","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Use after free in Reading Mode in Google Chrome prior to 121.0.6167.85 allowed an attacker who convinced a user to install a malicious extension to potentially exploit heap corruption via specific UI interaction. (Chromium security severity: Medium)"},{"lang":"es","value":"Use after free en Reading Mode en Google Chrome anterior a 121.0.6167.85 permitió a un atacante convencer a un usuario de instalar una extensión maliciosa para explotar potencialmente la corrupción del montón a través de una interacción específica de la interfaz de usuario. (Severidad de seguridad de Chromium: media)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1477151","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-0814","sourceIdentifier":"chrome-cve-admin@google.com","published":"2024-01-24T00:15:08.273","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"Incorrect security UI in Payments in Google Chrome prior to 121.0.6167.85 allowed a remote attacker to potentially spoof security UI via a crafted HTML page. (Chromium security severity: Medium)"},{"lang":"es","value":"La interfaz de usuario de seguridad incorrecta en Payments en Google Chrome anterior a 121.0.6167.85 permitía a un atacante remoto falsificar potencialmente la interfaz de usuario de seguridad a través de una página HTML manipulada. (Severidad de seguridad de Chromium: media)"}],"metrics":{},"references":[{"url":"https:\/\/chromereleases.googleblog.com\/2024\/01\/stable-channel-update-for-desktop_23.html","source":"chrome-cve-admin@google.com"},{"url":"https:\/\/crbug.com\/1463935","source":"chrome-cve-admin@google.com"}]}},{"cve":{"id":"CVE-2024-23453","sourceIdentifier":"vultures@jpcert.or.jp","published":"2024-01-24T00:15:08.327","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Android Spoon application version 7.11.1 to 8.6.0 uses hard-coded credentials, which may allow a local attacker to retrieve the hard-coded API key when the application binary is reverse-engineered. This API key may be used for unexpected access of the associated service."},{"lang":"es","value":"La versión 7.11.1 a 8.6.0 de la aplicación Android Spoon utiliza credenciales codificadas, lo que puede permitir a un atacante local recuperar la clave API codificada cuando se aplica ingeniería inversa al binario de la aplicación. Esta clave API se puede utilizar para acceso inesperado al servicio asociado."}],"metrics":{},"references":[{"url":"https:\/\/jvn.jp\/en\/jp\/JVN96154238\/","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/play.google.com\/store\/apps\/details?id=co.spoonme&hl=en_US","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/spoon-support.spooncast.net\/jp\/update","source":"vultures@jpcert.or.jp"}]}},{"cve":{"id":"CVE-2024-23633","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T00:15:08.373","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Label Studio, an open source data labeling tool had a remote import feature allowed users to import data from a remote web source, that was downloaded and could be viewed on the website. Prior to version 1.10.1, this feature could had been abused to download a HTML file that executed malicious JavaScript code in the context of the Label Studio website. Executing arbitrary JavaScript could result in an attacker performing malicious actions on Label Studio users if they visit the crafted avatar image. For an example, an attacker can craft a JavaScript payload that adds a new Django Super Administrator user if a Django administrator visits the image.\n\n`data_import\/uploader.py` lines 125C5 through 146 showed that if a URL passed the server side request forgery verification checks, the contents of the file would be downloaded using the filename in the URL. The downloaded file path could then be retrieved by sending a request to `\/api\/projects\/{project_id}\/file-uploads?ids=[{download_id}]` where `{project_id}` was the ID of the project and `{download_id}` was the ID of the downloaded file. Once the downloaded file path was retrieved by the previous API endpoint, `data_import\/api.py`lines 595C1 through 616C62 demonstrated that the `Content-Type` of the response was determined by the file extension, since `mimetypes.guess_type` guesses the `Content-Type` based on the file extension. Since the `Content-Type` was determined by the file extension of the downloaded file, an attacker could import in a `.html` file that would execute JavaScript when visited.\n\nVersion 1.10.1 contains a patch for this issue. Other remediation strategies are also available. For all user provided files that are downloaded by Label Studio, set the `Content-Security-Policy: sandbox;` response header when viewed on the site. The `sandbox` directive restricts a page's actions to prevent popups, execution of plugins and scripts and enforces a `same-origin` policy. Alternatively, restrict the allowed file extensions that may be downloaded."},{"lang":"es","value":"Label Studio, una herramienta de etiquetado de datos de código abierto, tenía una función de importación remota que permitía a los usuarios importar datos desde una fuente web remota, que se descargaba y se podía ver en el sitio web. Antes de la versión 1.10.1, se podía abusar de esta característica para descargar un archivo HTML que ejecutaba código JavaScript malicioso en el contexto del sitio web de Label Studio. La ejecución de JavaScript arbitrario podría provocar que un atacante realice acciones maliciosas en los usuarios de Label Studio si visitan la imagen de avatar creada. Por ejemplo, un atacante puede crear un payload de JavaScript que agregue un nuevo usuario de Superadministrador de Django si un administrador de Django visita la imagen. Las líneas 125C5 a 146 de `data_import\/uploader.py` mostraban que si una URL pasaba las verificaciones de verificación de server side request forgery, el contenido del archivo se descargaría usando el nombre de archivo en la URL. La ruta del archivo descargado podría recuperarse enviando una solicitud a `\/api\/projects\/{project_id}\/file-uploads?ids=[{download_id}]` donde `{project_id}` era el ID del proyecto y `{ download_id}` era el ID del archivo descargado. Una vez que el endpoint API anterior recuperó la ruta del archivo descargado, las líneas `data_import\/api.py` 595C1 a 616C62 demostraron que el `Content-Type` de la respuesta estaba determinado por la extensión del archivo, ya que `mimetypes.guess_type` adivina el `Tipo de contenido` basado en la extensión del archivo. Dado que el \"Tipo de contenido\" estaba determinado por la extensión del archivo descargado, un atacante podría importar un archivo \".html\" que ejecutaría JavaScript cuando lo visitara. La versión 1.10.1 contiene un parche para este problema. También se encuentran disponibles otras estrategias de remediación. Para todos los archivos proporcionados por el usuario que Label Studio descarga, configure el encabezado de respuesta `Content-Security-Policy: sandbox;` cuando se vea en el sitio. La directiva `sandbox` restringe las acciones de una página para evitar ventanas emergentes, la ejecución de complementos y scripts y aplica una política de `mismo origen`. Alternativamente, restrinja las extensiones de archivos permitidas que se pueden descargar."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:R\/S:C\/C:L\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"REQUIRED","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":4.7,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.8,"impactScore":1.4}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Secondary","description":[{"lang":"en","value":"CWE-79"}]}],"references":[{"url":"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/HTTP\/Headers\/Content-Security-Policy\/sandbox","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/HumanSignal\/label-studio\/blob\/1.9.2.post0\/label_studio\/data_import\/api.py#L595C1-L616C62","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/HumanSignal\/label-studio\/blob\/1.9.2.post0\/label_studio\/data_import\/uploader.py#L125C5-L146","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/HumanSignal\/label-studio\/security\/advisories\/GHSA-fq23-g58m-799r","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2024-23638","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T00:15:08.573","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Squid is a caching proxy for the Web. Due to an expired pointer reference bug, Squid prior to version 6.6 is vulnerable to a Denial of Service attack against Cache Manager error responses. This problem allows a trusted client to perform Denial of Service when generating error pages for Client Manager reports. Squid older than 5.0.5 have not been tested and should be assumed to be vulnerable. All Squid-5.x up to and including 5.9 are vulnerable. All Squid-6.x up to and including 6.5 are vulnerable. This bug is fixed by Squid version 6.6. In addition, patches addressing this problem for the stable releases can be found in Squid's patch archives. As a workaround, prevent access to Cache Manager using Squid's main access control: `http_access deny manager`."},{"lang":"es","value":"Squid es un proxy de almacenamiento en caché para la Web. Debido a un error de referencia de puntero caducado, Squid anterior a la versión 6.6 es vulnerable a un ataque de denegación de servicio contra las respuestas de error del Administrador de Caché. Este problema permite que un cliente confiable realice una Denegación de Servicio al generar páginas de error para los informes de Client Manager. Los calamares mayores de 5.0.5 no han sido probados y se debe suponer que son vulnerables. Todos los Squid-5.x hasta 5.9 includa, son vulnerables. Todos los Squid-6.x hasta 6.5 includa, son vulnerables. Este error se solucionó con la versión 6.6 de Squid. Además, los parches que solucionan este problema para las versiones estables se pueden encontrar en los archivos de parches de Squid. Como workaround, evite el acceso al Administrador de caché utilizando el control de acceso principal de Squid: `http_access deny manager`."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:L\/UI:N\/S:U\/C:N\/I:N\/A:H","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"LOW","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"NONE","availabilityImpact":"HIGH","baseScore":6.5,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.8,"impactScore":3.6}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Primary","description":[{"lang":"en","value":"CWE-825"}]}],"references":[{"url":"http:\/\/www.squid-cache.org\/Versions\/v5\/SQUID-2023_11.patch","source":"security-advisories@github.com"},{"url":"http:\/\/www.squid-cache.org\/Versions\/v6\/SQUID-2023_11.patch","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/squid-cache\/squid\/commit\/290ae202883ac28a48867079c2fb34c40efd382b","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/squid-cache\/squid\/commit\/e8118a7381213f5cfcdeb4cec1d2d854bfd261c8","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/squid-cache\/squid\/security\/advisories\/GHSA-j49p-553x-48rx","source":"security-advisories@github.com"},{"url":"https:\/\/megamansec.github.io\/Squid-Security-Audit\/stream-assert.html","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2022-4964","sourceIdentifier":"security@ubuntu.com","published":"2024-01-24T01:15:07.977","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Ubuntu's pipewire-pulse in snap grants microphone access even when the snap interface for audio-record is not set."},{"lang":"es","value":"Pipewire-pulse en snap de Ubuntu otorga acceso al micrófono incluso cuando la interfaz snap para grabación de audio no está configurada."}],"metrics":{"cvssMetricV31":[{"source":"security@ubuntu.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:L\/AC:L\/PR:L\/UI:N\/S:U\/C:H\/I:N\/A:N","attackVector":"LOCAL","attackComplexity":"LOW","privilegesRequired":"LOW","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":5.5,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.8,"impactScore":3.6}]},"references":[{"url":"https:\/\/bugs.launchpad.net\/ubuntu\/+source\/pipewire\/+bug\/1995707\/","source":"security@ubuntu.com"},{"url":"https:\/\/cve.mitre.org\/cgi-bin\/cvename.cgi?name=CVE-2022-4964","source":"security@ubuntu.com"},{"url":"https:\/\/gitlab.freedesktop.org\/pipewire\/pipewire\/-\/merge_requests\/1779","source":"security@ubuntu.com"},{"url":"https:\/\/gitlab.freedesktop.org\/pipewire\/wireplumber\/-\/merge_requests\/567","source":"security@ubuntu.com"}]}},{"cve":{"id":"CVE-2024-21765","sourceIdentifier":"vultures@jpcert.or.jp","published":"2024-01-24T02:15:07.110","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Electronic Delivery Check System (Doboku) Ver.18.1.0 and earlier, Electronic Delivery Check System (Dentsu) Ver.12.1.0 and earlier, Electronic Delivery Check System (Kikai) Ver.10.1.0 and earlier, and Electronic delivery item Inspection Support SystemVer.4.0.31 and earlier improperly restrict XML external entity references (XXE). By processing a specially crafted XML file, arbitrary files on the system may be read by an attacker."},{"lang":"es","value":"Electronic Delivery Check System (Doboku) versión 18.1.0 y anterior,\nElectronic Delivery Check System (Dentsu) versión 12.1.0 y anterior,\nElectronic Delivery Check System (Kikai) versión 10.1.0 y anterior, y\nElectronic delivery item Inspection Support SystemVer.4.0.31 y anteriores,\nrestringen incorrectamente las referencias de entidades externas XML (XXE). Al procesar un archivo XML especialmente manipulado, un atacante puede leer archivos arbitrarios del sistema."}],"metrics":{},"references":[{"url":"http:\/\/www.cals-ed.go.jp\/checksys-release-20231130\/","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/jvn.jp\/en\/jp\/JVN77736613\/","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/www.ysk.nilim.go.jp\/cals\/","source":"vultures@jpcert.or.jp"}]}},{"cve":{"id":"CVE-2024-21796","sourceIdentifier":"vultures@jpcert.or.jp","published":"2024-01-24T02:15:07.180","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Electronic Deliverables Creation Support Tool (Construction Edition) prior to Ver1.0.4 and Electronic Deliverables Creation Support Tool (Design & Survey Edition) prior to Ver1.0.4 improperly restrict XML external entity references (XXE). By processing a specially crafted XML file, arbitrary files on the system may be read by an attacker."},{"lang":"es","value":"Electronic Deliverables Creation Support Tool (Construction Edition) anterior a la versión 1.0.4 y Electronic Deliverables Creation Support Tool (Design &amp; Survey Edition) anterior a la versión 1.0.4 restringen incorrectamente las referencias de entidades externas XML (XXE). Al procesar un archivo XML especialmente manipulado, un atacante puede leer archivos arbitrarios del sistema."}],"metrics":{},"references":[{"url":"https:\/\/jvn.jp\/en\/jp\/JVN40049211\/","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/www.dfeg.mod.go.jp\/hp\/contents-dfis\/tool.html","source":"vultures@jpcert.or.jp"}]}},{"cve":{"id":"CVE-2024-22380","sourceIdentifier":"vultures@jpcert.or.jp","published":"2024-01-24T02:15:07.233","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Electronic Delivery Check System (Ministry of Agriculture, Forestry and Fisheries The Agriculture and Rural Development Project Version) March, Heisei 31 era edition Ver.14.0.001.002 and earlier improperly restricts XML external entity references (XXE). By processing a specially crafted XML file, arbitrary files on the system may be read by an attacker."},{"lang":"es","value":"Electronic Delivery Check System (Ministry of Agriculture, Forestry and Fisheries The Agriculture and Rural Development Project Version) March, Heisei 31 era edition Ver.14.0.001.002 y anteriores, restringe indebidamente las referencias de entidades externas XML (XXE). Al procesar un archivo XML especialmente manipulado, un atacante puede leer archivos arbitrarios del sistema."}],"metrics":{},"references":[{"url":"https:\/\/jvn.jp\/en\/jp\/JVN01434915\/","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/www.maff.go.jp\/j\/nousin\/seko\/nouhin_youryou\/densi.html","source":"vultures@jpcert.or.jp"}]}},{"cve":{"id":"CVE-2023-31037","sourceIdentifier":"psirt@nvidia.com","published":"2024-01-24T03:15:08.100","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"\nNVIDIA Bluefield 2 and Bluefield 3 DPU BMC contains a vulnerability in ipmitool, where a root user may cause code injection by a network call. A successful exploit of this vulnerability may lead to code execution on the OS.\n\n"},{"lang":"es","value":"NVIDIA Bluefield 2 y Bluefield 3 DPU BMC contienen una vulnerabilidad en ipmitool, donde un usuario root puede provocar la inyección de código mediante una llamada de red. Una explotación exitosa de esta vulnerabilidad puede provocar la ejecución de código en el sistema operativo."}],"metrics":{"cvssMetricV31":[{"source":"psirt@nvidia.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:H\/UI:N\/S:U\/C:H\/I:H\/A:H","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":7.2,"baseSeverity":"HIGH"},"exploitabilityScore":1.2,"impactScore":5.9}]},"weaknesses":[{"source":"psirt@nvidia.com","type":"Secondary","description":[{"lang":"en","value":"CWE-94"}]}],"references":[{"url":"https:\/\/nvidia.custhelp.com\/app\/answers\/detail\/a_id\/5511","source":"psirt@nvidia.com"}]}},{"cve":{"id":"CVE-2024-22366","sourceIdentifier":"vultures@jpcert.or.jp","published":"2024-01-24T05:15:13.823","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Active debug code exists in Yamaha wireless LAN access point devices. If a logged-in user who knows how to use the debug function accesses the device's management page, this function can be enabled by performing specific operations. As a result, an arbitrary OS command may be executed and\/or configuration settings of the device may be altered. Affected products and versions are as follows: WLX222 firmware Rev.24.00.03 and earlier, WLX413 firmware Rev.22.00.05 and earlier, WLX212 firmware Rev.21.00.12 and earlier, WLX313 firmware Rev.18.00.12 and earlier, and WLX202 firmware Rev.16.00.18 and earlier."},{"lang":"es","value":"Existe un código de depuración activo en los dispositivos de punto de acceso a LAN inalámbrica de Yamaha. Si un usuario que ha iniciado sesión y sabe cómo utilizar la función de depuración accede a la página de administración del dispositivo, esta función se puede habilitar realizando operaciones específicas. Como resultado, se puede ejecutar un comando arbitrario del sistema operativo y\/o se pueden alterar los ajustes de configuración del dispositivo. Los productos y versiones afectados son los siguientes: firmware WLX222 Rev.24.00.03 y anteriores, firmware WLX413 Rev.22.00.05 y anteriores, firmware WLX212 Rev.21.00.12 y anteriores, firmware WLX313 Rev.18.00.12 y anteriores, y WLX202 firmware Rev.16.00.18 y anteriores."}],"metrics":{},"references":[{"url":"http:\/\/www.rtpro.yamaha.co.jp\/RT\/FAQ\/Security\/JVNVU99896362.html","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/jvn.jp\/en\/vu\/JVNVU99896362\/","source":"vultures@jpcert.or.jp"}]}},{"cve":{"id":"CVE-2024-22372","sourceIdentifier":"vultures@jpcert.or.jp","published":"2024-01-24T05:15:14.137","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"OS command injection vulnerability in ELECOM wireless LAN routers allows a network-adjacent attacker with an administrative privilege to execute arbitrary OS commands by sending a specially crafted request to the product. Affected products and versions are as follows: WRC-X1800GS-B v1.17 and earlier, WRC-X1800GSA-B v1.17 and earlier, WRC-X1800GSH-B v1.17 and earlier, WRC-X6000XS-G v1.09, and WRC-X6000XST-G v1.12 and earlier."},{"lang":"es","value":"La vulnerabilidad de inyección de comandos del sistema operativo en los routers LAN inalámbricos ELECOM permite que un atacante adyacente a la red con privilegios administrativos ejecute comandos arbitrarios del sistema operativo enviando una solicitud especialmente manipulada al producto. Los productos y versiones afectados son los siguientes: WRC-X1800GS-B v1.17 y anteriores, WRC-X1800GSA-B v1.17 y anteriores, WRC-X1800GSH-B v1.17 y anteriores, WRC-X6000XS-G v1.09, y WRC-X6000XST-G v1.12 y anteriores."}],"metrics":{},"references":[{"url":"https:\/\/jvn.jp\/en\/vu\/JVNVU90908488\/","source":"vultures@jpcert.or.jp"},{"url":"https:\/\/www.elecom.co.jp\/news\/security\/20240123-01\/","source":"vultures@jpcert.or.jp"}]}},{"cve":{"id":"CVE-2023-43317","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T07:15:46.300","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue in Coign CRM Portal v.06.06 allows a remote attacker to escalate privileges via the userPermissionsList parameter in Session Storage component."},{"lang":"es","value":"Un problema en Coign CRM Portal v.06.06 permite a un atacante remoto escalar privilegios a través del parámetro userPermissionsList en el componente Session Storage."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/amjadali-110\/CVE-2023-43317\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51711","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T07:15:47.360","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue was discovered in Regify Regipay Client for Windows version 4.5.1.0 allows DLL hijacking: a user can trigger the execution of arbitrary code every time the product is executed."},{"lang":"es","value":"Se descubrió un problema en Regify Regipay Client para Windows versión 4.5.1.0 que permite el secuestro de DLL: un usuario puede desencadenar la ejecución de código arbitrario cada vez que se ejecuta el producto."}],"metrics":{},"references":[{"url":"https:\/\/excellium-services.com\/cert-xlm-advisory\/cve-2023-51711\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-0665","sourceIdentifier":"security@wordfence.com","published":"2024-01-24T08:15:37.920","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"The WP Customer Area plugin for WordPress is vulnerable to Reflected Cross-Site Scripting via the 'tab' parameter in all versions up to, and including, 8.2.1 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link."},{"lang":"es","value":"El complemento WP Customer Area para WordPress es vulnerable a Cross-Site Scripting Reflejado a través del parámetro 'tab' en todas las versiones hasta la 8.2.1 incluida debido a una sanitización de entrada y un escape de salida insuficientes. Esto hace posible que atacantes no autenticados inyecten scripts web arbitrarios en páginas que se ejecutan si logran engañar a un usuario para que realice una acción como hacer clic en un enlace."}],"metrics":{"cvssMetricV31":[{"source":"security@wordfence.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:R\/S:C\/C:L\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"REQUIRED","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":6.1,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.8,"impactScore":2.7}]},"references":[{"url":"https:\/\/plugins.trac.wordpress.org\/changeset\/3025865\/customer-area\/trunk\/src\/php\/core-addons\/admin-area\/templates\/dashboard-page.template.php","source":"security@wordfence.com"},{"url":"https:\/\/plugins.trac.wordpress.org\/changeset?sfp_email=&sfph_mail=&reponame=&old=3024180%40customer-area&new=3024180%40customer-area&sfp_email=&sfph_mail=","source":"security@wordfence.com"},{"url":"https:\/\/www.wordfence.com\/threat-intel\/vulnerabilities\/id\/567d62ec-e868-45e2-b07a-8cc661d7c5e1?source=cve","source":"security@wordfence.com"}]}},{"cve":{"id":"CVE-2023-43988","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.357","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in nature fitness saijo mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app natural fitness saijo en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas a través de la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43988.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43989","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.410","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in mokumoku chohu mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app mokumoku chohu en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43989.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43990","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.463","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in cherub-hair mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app cherub-hair en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43990.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43991","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.510","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in PRIMA CLINIC mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app PRIMA CLINIC en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43991.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43992","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.670","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in STOCKMAN GROUP mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app STOCKMAN GROUP en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43992.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43993","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.843","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in smaregi_app_market mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app smaregi_app_market en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43993.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43994","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.897","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in Cleaning_makotoya mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app Cleaning_makotoya en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43994.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43995","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:08.950","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in picot.golf mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app picot.golf en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43995.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43996","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:09.003","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in Q co ltd mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app Q co ltd en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43996.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43997","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:09.140","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in Yoruichi hobby base mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app Yoruichi Hobby Base en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43997.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43998","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:09.287","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in Books-futaba mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app Books-futaba en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43998.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-43999","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:09.343","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in COLORFUL_laundry mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app COLORFUL_laundry en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-43999.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-44000","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:09.393","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in Otakara lapis totuka mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app Otakara lapis totuka en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-44000.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-44001","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T10:15:09.440","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Undergoing Analysis","descriptions":[{"lang":"en","value":"An issue in Ailand clinic mini-app on Line v13.6.1 allows attackers to send crafted malicious notifications via leakage of the channel access token."},{"lang":"es","value":"Un problema en la mini-app de la clínica Ailand en Line v13.6.1 permite a los atacantes enviar notificaciones maliciosas manipuladas mediante la fuga del token de acceso al canal."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/syz913\/CVE-reports\/blob\/main\/CVE-2023-44001.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-0854","sourceIdentifier":"security@synology.com","published":"2024-01-24T10:15:09.533","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"URL redirection to untrusted site ('Open Redirect') vulnerability in file access component in Synology DiskStation Manager (DSM) before 7.2.1-69057-2 allows remote authenticated users to conduct phishing attacks via unspecified vectors."},{"lang":"es","value":"La vulnerabilidad de redirección de URL a un sitio que no es de confianza (\"Open Redirect\") en el componente de acceso a archivos de Synology DiskStation Manager (DSM) anterior a 7.2.1-69057-2 permite a usuarios remotos autenticados realizar ataques de phishing a través de vectores no especificados."}],"metrics":{"cvssMetricV31":[{"source":"security@synology.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:L\/UI:R\/S:C\/C:N\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"LOW","userInteraction":"REQUIRED","scope":"CHANGED","confidentialityImpact":"NONE","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":4.1,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.3,"impactScore":1.4}]},"weaknesses":[{"source":"security@synology.com","type":"Primary","description":[{"lang":"en","value":"CWE-601"}]}],"references":[{"url":"https:\/\/www.synology.com\/en-global\/security\/advisory\/Synology_SA_24_02","source":"security@synology.com"}]}},{"cve":{"id":"CVE-2023-52221","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:56.907","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Unrestricted Upload of File with Dangerous Type vulnerability in UkrSolution Barcode Scanner and Inventory manager.This issue affects Barcode Scanner and Inventory manager: from n\/a through 1.5.1.\n\n"},{"lang":"es","value":"Carga sin restricciones de archivos con vulnerabilidad de tipo peligroso en UkrSolution Barcode Scanner y Inventory Manager. Este problema afecta a Barcode Scanner y Inventory Manager: desde n\/a hasta 1.5.1."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:C\/C:H\/I:H\/A:H","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":10.0,"baseSeverity":"CRITICAL"},"exploitabilityScore":3.9,"impactScore":6.0}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Secondary","description":[{"lang":"en","value":"CWE-434"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/barcode-scanner-lite-pos-to-manage-products-inventory-and-orders\/wordpress-barcode-scanner-with-inventory-order-manager-plugin-1-5-1-unauthenticated-arbitrary-file-upload-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22134","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:57.297","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Server-Side Request Forgery (SSRF) vulnerability in Renzo Johnson Contact Form 7 Extension For Mailchimp.This issue affects Contact Form 7 Extension For Mailchimp: from n\/a through 0.5.70.\n\n"},{"lang":"es","value":"Vulnerabilidad de Server-Side Request Forgery (SSRF) en Renzo Johnson Contact Form 7 Extension For Mailchimp. Este problema afecta a Contact Form 7 Extension For Mailchimp: desde n\/a hasta 0.5.70."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:L\/UI:N\/S:C\/C:L\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"LOW","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":4.9,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.8,"impactScore":2.7}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-918"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/contact-form-7-mailchimp-extension\/wordpress-contact-form-7-extension-for-mailchimp-plugin-0-5-70-server-side-request-forgery-ssrf-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22135","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:57.500","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Unrestricted Upload of File with Dangerous Type vulnerability in WebToffee Order Export & Order Import for WooCommerce.This issue affects Order Export & Order Import for WooCommerce: from n\/a through 2.4.3.\n\n"},{"lang":"es","value":"Carga sin restricciones de archivos con vulnerabilidad de tipo peligroso en WebToffee Order Export &amp; Order Import para WooCommerce. Este problema afecta Order Export &amp; Order Import for WooCommerce: desde n\/a hasta 2.4.3."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:H\/UI:N\/S:C\/C:H\/I:H\/A:H","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":8.0,"baseSeverity":"HIGH"},"exploitabilityScore":1.3,"impactScore":6.0}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-434"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/order-import-export-for-woocommerce\/wordpress-order-export-order-import-for-woocommerce-plugin-2-4-3-arbitrary-file-upload-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22152","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:57.700","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Unrestricted Upload of File with Dangerous Type vulnerability in WebToffee Product Import Export for WooCommerce.This issue affects Product Import Export for WooCommerce: from n\/a through 2.3.7.\n\n"},{"lang":"es","value":"Carga sin restricciones de archivos con vulnerabilidad de tipo peligroso en WebToffee Product Import Export para WooCommerce. Este problema afecta a Product Import Export para WooCommerce: desde n\/a hasta 2.3.7."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:H\/UI:N\/S:C\/C:H\/I:H\/A:H","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":8.0,"baseSeverity":"HIGH"},"exploitabilityScore":1.3,"impactScore":6.0}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-434"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/product-import-export-for-woo\/wordpress-product-import-export-for-woocommerce-plugin-2-3-7-arbitrary-file-upload-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22284","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:57.893","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Deserialization of Untrusted Data vulnerability in Thomas Belser Asgaros Forum.This issue affects Asgaros Forum: from n\/a through 2.7.2.\n\n"},{"lang":"es","value":"Vulnerabilidad de deserialización de datos no confiables en Thomas Belser Asgaros Forum. Este problema afecta a Asgaros Forum: desde n\/a hasta 2.7.2."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:N\/UI:N\/S:C\/C:H\/I:H\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"NONE","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"NONE","baseScore":8.7,"baseSeverity":"HIGH"},"exploitabilityScore":2.2,"impactScore":5.8}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-502"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/asgaros-forum\/wordpress-asgaros-forum-plugin-2-7-2-php-object-injection-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22294","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:58.093","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Exposure of Sensitive Information to an Unauthorized Actor vulnerability in IP2Location IP2Location Country Blocker.This issue affects IP2Location Country Blocker: from n\/a through 2.33.3.\n\n"},{"lang":"es","value":"Exposición de información confidencial a una vulnerabilidad de actor no autorizado en IP2Location IP2Location Country Blocker. Este problema afecta a IP2Location Country Blocker: desde n\/a hasta 2.33.3."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:L\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"LOW","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":5.3,"baseSeverity":"MEDIUM"},"exploitabilityScore":3.9,"impactScore":1.4}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-200"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/ip2location-country-blocker\/wordpress-ip2location-country-blocker-plugin-2-33-3-sensitive-data-exposure-via-log-file-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22301","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:58.290","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Exposure of Sensitive Information to an Unauthorized Actor vulnerability in Ignazio Scimone Albo Pretorio On line.This issue affects Albo Pretorio On line: from n\/a through 4.6.6.\n\n"},{"lang":"es","value":"Vulnerabilidad de exposición de información confidencial a un actor no autorizado en Ignazio Scimone Albo Pretorio On line. Este problema afecta a Albo Pretorio On line: desde n\/a hasta 4.6.6."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:L\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"LOW","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":5.3,"baseSeverity":"MEDIUM"},"exploitabilityScore":3.9,"impactScore":1.4}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-200"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/albo-pretorio-on-line\/wordpress-albo-pretorio-on-line-plugin-4-6-6-sensitive-data-exposure-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22308","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:58.483","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"URL Redirection to Untrusted Site ('Open Redirect') vulnerability in smp7, wp.Insider Simple Membership.This issue affects Simple Membership: from n\/a through 4.4.1.\n\n"},{"lang":"es","value":"Vulnerabilidad de redirección de URL a un sitio que no es de confianza (\"Open Redirect\") en smp7, wp.Insider Simple Membership. Este problema afecta a Simple Membership: desde n\/a hasta 4.4.1."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:N\/UI:R\/S:C\/C:L\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"NONE","userInteraction":"REQUIRED","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":3.4,"baseSeverity":"LOW"},"exploitabilityScore":1.6,"impactScore":1.4}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Secondary","description":[{"lang":"en","value":"CWE-601"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/simple-membership\/wordpress-simple-membership-plugin-4-4-1-open-redirection-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2024-22309","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T12:15:58.677","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Deserialization of Untrusted Data vulnerability in QuantumCloud ChatBot with AI.This issue affects ChatBot with AI: from n\/a through 5.1.0.\n\n"},{"lang":"es","value":"Vulnerabilidad de deserialización de datos no confiables en QuantumCloud ChatBot con AI. Este problema afecta a ChatBot con AI: desde n\/a hasta 5.1.0."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:N\/UI:N\/S:C\/C:H\/I:H\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"NONE","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"NONE","baseScore":8.7,"baseSeverity":"HIGH"},"exploitabilityScore":2.2,"impactScore":5.8}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-502"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/chatbot\/wordpress-ai-chatbot-plugin-5-1-0-unauthenticated-php-object-injection-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2023-50943","sourceIdentifier":"security@apache.org","published":"2024-01-24T13:15:07.953","lastModified":"2024-01-24T15:15:08.537","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Apache Airflow, versions before 2.8.1, have a vulnerability that allows a potential attacker to poison the XCom data by bypassing the protection of \"enable_xcom_pickling=False\" configuration setting resulting in poisoned data after XCom deserialization. This vulnerability is considered low since it requires a DAG author to exploit it. Users are recommended to upgrade to version 2.8.1 or later, which fixes this issue.\n"},{"lang":"es","value":"Apache Airflow, versiones anteriores a 2.8.1, tienen una vulnerabilidad que permite a un atacante potencial envenenar los datos de XCom al evadir la protección de la configuración \"enable_xcom_pickling=False\", lo que genera datos envenenados después de la deserialización de XCom. Esta vulnerabilidad se considera baja ya que requiere un autor de DAG para explotarla. Se recomienda a los usuarios actualizar a la versión 2.8.1 o posterior, que soluciona este problema."}],"metrics":{},"weaknesses":[{"source":"security@apache.org","type":"Secondary","description":[{"lang":"en","value":"CWE-502"}]}],"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/4","source":"security@apache.org"},{"url":"https:\/\/github.com\/apache\/airflow\/pull\/36255","source":"security@apache.org"},{"url":"https:\/\/lists.apache.org\/thread\/fx278v0twqzxkcts70tc04cp3f8p56pn","source":"security@apache.org"}]}},{"cve":{"id":"CVE-2023-50944","sourceIdentifier":"security@apache.org","published":"2024-01-24T13:15:08.070","lastModified":"2024-01-24T15:15:08.600","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Apache Airflow, versions before 2.8.1, have a vulnerability that allows an authenticated user to access the source code of a DAG to which they don't have access. This vulnerability is considered low since it requires an authenticated user to exploit it. Users are recommended to upgrade to version 2.8.1, which fixes this issue.\n"},{"lang":"es","value":"Apache Airflow, versiones anteriores a la 2.8.1, tienen una vulnerabilidad que permite a un usuario autenticado acceder al código fuente de un DAG al que no tiene acceso. Esta vulnerabilidad se considera baja ya que requiere un usuario autenticado para explotarla. Se recomienda a los usuarios actualizar a la versión 2.8.1, que soluciona este problema."}],"metrics":{},"weaknesses":[{"source":"security@apache.org","type":"Primary","description":[{"lang":"en","value":"CWE-862"}]}],"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/5","source":"security@apache.org"},{"url":"https:\/\/github.com\/apache\/airflow\/pull\/36257","source":"security@apache.org"},{"url":"https:\/\/lists.apache.org\/thread\/92krb5mpcq8qrw4t4j5oooqw7hgd8q7h","source":"security@apache.org"}]}},{"cve":{"id":"CVE-2023-51702","sourceIdentifier":"security@apache.org","published":"2024-01-24T13:15:08.150","lastModified":"2024-01-24T15:15:08.663","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Since version 5.2.0, when using deferrable mode with the path of a Kubernetes configuration file for authentication, the Airflow worker serializes this configuration file as a dictionary and sends it to the triggerer by storing it in metadata without any encryption. Additionally, if used with an Airflow version between 2.3.0 and 2.6.0, the configuration dictionary will be logged as plain text in the triggerer service without masking. This allows anyone with access to the metadata or triggerer log to obtain the configuration file and use it to access the Kubernetes cluster.\n\nThis behavior was changed in version 7.0.0, which stopped serializing the file contents and started providing the file path instead to read the contents into the trigger. Users are recommended to upgrade to version 7.0.0, which fixes this issue."},{"lang":"es","value":"Desde la versión 5.2.0, cuando se utiliza el modo diferible con la ruta de un archivo de configuración de Kubernetes para la autenticación, el trabajador de Airflow serializa este archivo de configuración como un diccionario y lo envía al activador almacenándolo en metadatos sin ningún cifrado. Además, si se utiliza con una versión de Airflow entre 2.3.0 y 2.6.0, el diccionario de configuración se registrará como texto plano en el servicio activador sin enmascaramiento. Esto permite que cualquier persona con acceso a los metadatos o al registro del activador obtenga el archivo de configuración y lo utilice para acceder al clúster de Kubernetes. Este comportamiento se cambió en la versión 7.0.0, que dejó de serializar el contenido del archivo y comenzó a proporcionar la ruta del archivo para leer el contenido en el activador. Se recomienda a los usuarios actualizar a la versión 7.0.0, que soluciona este problema."}],"metrics":{},"weaknesses":[{"source":"security@apache.org","type":"Primary","description":[{"lang":"en","value":"CWE-312"},{"lang":"en","value":"CWE-532"}]}],"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/3","source":"security@apache.org"},{"url":"https:\/\/github.com\/apache\/airflow\/pull\/29498","source":"security@apache.org"},{"url":"https:\/\/github.com\/apache\/airflow\/pull\/30110","source":"security@apache.org"},{"url":"https:\/\/github.com\/apache\/airflow\/pull\/36492","source":"security@apache.org"},{"url":"https:\/\/lists.apache.org\/thread\/89x3q6lz5pykrkr1fkr04k4rfn9pvnv9","source":"security@apache.org"}]}},{"cve":{"id":"CVE-2024-22154","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T13:15:08.260","lastModified":"2024-01-24T13:49:03.187","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Exposure of Sensitive Information to an Unauthorized Actor vulnerability in SNP Digital SalesKing.This issue affects SalesKing: from n\/a through 1.6.15.\n\n"},{"lang":"es","value":"Exposición de información confidencial a una vulnerabilidad de actor no autorizado en SNP Digital SalesKing. Este problema afecta a SalesKing: desde n\/a hasta 1.6.15."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:H\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":7.5,"baseSeverity":"HIGH"},"exploitabilityScore":3.9,"impactScore":3.6}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-200"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/salesking\/wordpress-salesking-plugin-1-6-15-unauthenticated-sensitive-data-exposure-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2023-6697","sourceIdentifier":"security@wordfence.com","published":"2024-01-24T14:15:08.320","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"The WP Go Maps (formerly WP Google Maps) plugin for WordPress is vulnerable to Reflected Cross-Site Scripting via the map id parameter in all versions up to, and including, 9.0.28 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link."},{"lang":"es","value":"El complemento WP Go Maps (anteriormente WP Google Maps) para WordPress es vulnerable a Cross-Site Scripting Reflejado a través del parámetro de identificación del mapa en todas las versiones hasta la 9.0.28 incluida debido a una sanitización de entrada y un escape de salida insuficientes. Esto hace posible que atacantes no autenticados inyecten scripts web arbitrarios en páginas que se ejecutan si logran engañar a un usuario para que realice una acción como hacer clic en un enlace."}],"metrics":{"cvssMetricV31":[{"source":"security@wordfence.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:R\/S:C\/C:L\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"REQUIRED","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":6.1,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.8,"impactScore":2.7}]},"references":[{"url":"https:\/\/plugins.trac.wordpress.org\/changeset\/3022232\/wp-google-maps\/trunk\/html\/atlas-novus\/map-edit-page\/map-edit-page.html.php","source":"security@wordfence.com"},{"url":"https:\/\/www.wordfence.com\/threat-intel\/vulnerabilities\/id\/b3c3115b-8921-429d-b517-b946edab1cd5?source=cve","source":"security@wordfence.com"}]}},{"cve":{"id":"CVE-2024-22141","sourceIdentifier":"audit@patchstack.com","published":"2024-01-24T15:15:08.730","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Exposure of Sensitive Information to an Unauthorized Actor vulnerability in Cozmoslabs Profile Builder Pro.This issue affects Profile Builder Pro: from n\/a through 3.10.0.\n\n"},{"lang":"es","value":"Exposición de información confidencial a una vulnerabilidad de actor no autorizado en Cozmoslabs Profile Builder Pro. Este problema afecta a Profile Builder Pro: desde n\/a hasta 3.10.0."}],"metrics":{"cvssMetricV31":[{"source":"audit@patchstack.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:L\/UI:N\/S:U\/C:H\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"LOW","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":6.5,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.8,"impactScore":3.6}]},"weaknesses":[{"source":"audit@patchstack.com","type":"Primary","description":[{"lang":"en","value":"CWE-200"}]}],"references":[{"url":"https:\/\/patchstack.com\/database\/vulnerability\/profile-builder-pro\/wordpress-profile-builder-pro-plugin-3-10-0-totp-secret-key-exposure-vulnerability?_s_id=cve","source":"audit@patchstack.com"}]}},{"cve":{"id":"CVE-2023-44281","sourceIdentifier":"security_alert@emc.com","published":"2024-01-24T16:15:08.110","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"\nDell Pair Installer version prior to 1.2.1 contains an elevation of privilege vulnerability. A low privilege user with local access to the system could potentially exploit this vulnerability to delete arbitrary files and result in Denial of Service.\n\n"},{"lang":"es","value":"La versión de Dell Pair Installer anterior a la 1.2.1 contiene una vulnerabilidad de elevación de privilegios. Un usuario con privilegios bajos y acceso local al sistema podría explotar esta vulnerabilidad para eliminar archivos arbitrarios y provocar una denegación de servicio."}],"metrics":{"cvssMetricV31":[{"source":"security_alert@emc.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:L\/AC:L\/PR:L\/UI:R\/S:U\/C:N\/I:H\/A:H","attackVector":"LOCAL","attackComplexity":"LOW","privilegesRequired":"LOW","userInteraction":"REQUIRED","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":6.6,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.3,"impactScore":5.2}]},"weaknesses":[{"source":"security_alert@emc.com","type":"Secondary","description":[{"lang":"en","value":"CWE-264"}]}],"references":[{"url":"https:\/\/www.dell.com\/support\/kbdoc\/en-us\/000219185\/dsa-2023-141","source":"security_alert@emc.com"}]}},{"cve":{"id":"CVE-2024-22651","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T16:15:08.630","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"There is a command injection vulnerability in the ssdpcgi_main function of cgibin binary in D-Link DIR-815 router firmware v1.04."},{"lang":"es","value":"Existe una vulnerabilidad de inyección de comandos en la función ssdpcgi_main del binario cgibin en el firmware del router D-Link DIR-815 v1.04."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/goldds96\/Report\/blob\/main\/DLink\/DIR-815\/CI.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-22725","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T16:15:08.687","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Orthanc versions before 1.12.2 are affected by a reflected cross-site scripting (XSS) vulnerability. The vulnerability was present in the server's error reporting."},{"lang":"es","value":"Las versiones de Orthanc anteriores a la 1.12.2 se ven afectadas por una vulnerabilidad de Cross-Site Scripting (XSS) Reflejada. La vulnerabilidad estaba presente en el informe de errores del servidor."}],"metrics":{},"references":[{"url":"https:\/\/orthanc.uclouvain.be\/hg\/orthanc\/file\/Orthanc-1.12.2\/NEWS","source":"cve@mitre.org"},{"url":"https:\/\/orthanc.uclouvain.be\/hg\/orthanc\/rev\/505416b269a0","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51885","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T17:15:08.257","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Buffer Overflow vulnerability in Mathtex v.1.05 and before allows a remote attacker to execute arbitrary code via the length of the LaTeX string component."},{"lang":"es","value":"Vulnerabilidad de desbordamiento de búfer en Mathtex v.1.05 y anteriores permite a un atacante remoto ejecutar código arbitrario a través de la longitud del componente de cadena LaTeX."}],"metrics":{},"references":[{"url":"https:\/\/blog.yulun.ac.cn\/posts\/2023\/fuzzing-mathtex\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51886","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T17:15:08.313","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Buffer Overflow vulnerability in the main() function in Mathtex 1.05 and before allows a remote attacker to cause a denial of service when using \\convertpath."},{"lang":"es","value":"Vulnerabilidad de desbordamiento de búfer en la función main() en Mathtex 1.05 y anteriores permite a un atacante remoto provocar una denegación de servicio al utilizar \\convertpath."}],"metrics":{},"references":[{"url":"https:\/\/blog.yulun.ac.cn\/posts\/2023\/fuzzing-mathtex\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51887","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T17:15:08.360","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Command Injection vulnerability in Mathtex v.1.05 and before allows a remote attacker to execute arbitrary code via crafted string in application URL."},{"lang":"es","value":"Vulnerabilidad de inyección de comandos en Mathtex v.1.05 y anteriores permite a un atacante remoto ejecutar código arbitrario a través de una cadena manipulada en la URL de la aplicación."}],"metrics":{},"references":[{"url":"https:\/\/blog.yulun.ac.cn\/posts\/2023\/fuzzing-mathtex\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-22229","sourceIdentifier":"security_alert@emc.com","published":"2024-01-24T17:15:08.410","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"\nDell Unity, versions prior to 5.4, contain a vulnerability whereby log messages can be spoofed by an authenticated attacker. An attacker could exploit this vulnerability to forge log entries, create false alarms, and inject malicious content into logs that compromise logs integrity. A malicious attacker could also prevent the product from logging information while malicious actions are performed or implicate an arbitrary user for malicious activities.\n\n"},{"lang":"es","value":"Dell Unity, versiones anteriores a la 5.4, contienen una vulnerabilidad por la cual un atacante autenticado puede falsificar los mensajes de registro. Un atacante podría aprovechar esta vulnerabilidad para falsificar entradas de registro, crear falsas alarmas e inyectar contenido malicioso en registros que comprometan su integridad. Un atacante malicioso también podría impedir que el producto registre información mientras se realizan acciones maliciosas o implicar a un usuario arbitrario por actividades maliciosas."}],"metrics":{"cvssMetricV31":[{"source":"security_alert@emc.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:L\/UI:N\/S:U\/C:N\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"LOW","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":3.1,"baseSeverity":"LOW"},"exploitabilityScore":1.6,"impactScore":1.4}]},"weaknesses":[{"source":"security_alert@emc.com","type":"Secondary","description":[{"lang":"en","value":"CWE-117"}]}],"references":[{"url":"https:\/\/www.dell.com\/support\/kbdoc\/en-us\/000213152\/dsa-2023-141-dell-unity-unity-vsa-and-unity-xt-security-update-for-multiple-vulnerabilities","source":"security_alert@emc.com"}]}},{"cve":{"id":"CVE-2024-23641","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T17:15:08.600","lastModified":"2024-01-24T18:45:34.830","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"SvelteKit is a web development kit. In SvelteKit 2, sending a GET request with a body eg `{}` to a built and previewed\/hosted sveltekit app throws `Request with GET\/HEAD method cannot have body.` and crashes the preview\/hosting. After this happens, one must manually restart the app. `TRACE` requests will also cause the app to crash. Prerendered pages and SvelteKit 1 apps are not affected. `@sveltejs\/adapter-node` versions 2.1.2, 3.0.3, and 4.0.1 and `@sveltejs\/kit` version 2.4.3 contain a patch for this issue."},{"lang":"es","value":"SvelteKit es un kit de desarrollo web. En SvelteKit 2, enviar una solicitud GET con un cuerpo, por ejemplo, `{}` a una aplicación Sveltekit creada y vista previa\/alojada arroja `La solicitud con el método GET\/HEAD no puede tener cuerpo.` y bloquea la vista previa\/alojamiento. Después de que esto suceda, se debe reiniciar manualmente la aplicación. Las solicitudes de `TRACE` también provocarán que la aplicación falle. Las páginas prerenderizadas y las aplicaciones SvelteKit 1 no se ven afectadas. `@sveltejs\/adapter-node` versiones 2.1.2, 3.0.3 y 4.0.1 y `@sveltejs\/kit` versión 2.4.3 contienen un parche para este problema."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:N\/I:N\/A:H","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"NONE","availabilityImpact":"HIGH","baseScore":7.5,"baseSeverity":"HIGH"},"exploitabilityScore":3.9,"impactScore":3.6}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Primary","description":[{"lang":"en","value":"CWE-20"}]}],"references":[{"url":"https:\/\/github.com\/sveltejs\/kit\/commit\/af34142631c876a7eb62ff81f71e8a3f90dafee9","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/sveltejs\/kit\/security\/advisories\/GHSA-g5m6-hxpp-fc49","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2021-42143","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.080","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue was discovered in Contiki-NG tinyDTLS through master branch 53a0d97. An infinite loop bug exists during the handling of a ClientHello handshake message. This bug allows remote attackers to cause a denial of service by sending a malformed ClientHello handshake message with an odd length of cipher suites, which triggers an infinite loop (consuming all resources) and a buffer over-read that can disclose sensitive information."},{"lang":"es","value":"Se descubrió un problema en Contiki-NG tinyDTLS a través de la rama maestra 53a0d97. Existe un error de bucle infinito durante el manejo de un mensaje de protocolo de enlace ClientHello. Este error permite a atacantes remotos provocar una denegación de servicio enviando un mensaje de protocolo de enlace ClientHello mal formado con una longitud impar de conjuntos de cifrado, lo que desencadena un bucle infinito (consumiendo todos los recursos) y una sobrelectura del búfer que puede revelar información confidencial."}],"metrics":{},"references":[{"url":"https:\/\/seclists.org\/fulldisclosure\/2024\/Jan\/16","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2021-42144","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.150","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Buffer over-read vulnerability in Contiki-NG tinyDTLS through master branch 53a0d97 allows attackers obtain sensitive information via crafted input to dtls_ccm_decrypt_message()."},{"lang":"es","value":"Vulnerabilidad de lectura excesiva del búfer en Contiki-NG tinyDTLS a través de la rama maestra 53a0d97 permite a los atacantes obtener información confidencial a través de entradas manipuladas en dtls_ccm_decrypt_message()."}],"metrics":{},"references":[{"url":"https:\/\/seclists.org\/fulldisclosure\/2024\/Jan\/17","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51888","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.240","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Buffer Overflow vulnerability in the nomath() function in Mathtex v.1.05 and before allows a remote attacker to cause a denial of service via a crafted string in the application URL."},{"lang":"es","value":"Vulnerabilidad de desbordamiento de búfer en la función nomath() en Mathtex v.1.05 y anteriores permite que un atacante remoto provoque una denegación de servicio a través de una cadena manipulada en la URL de la aplicación."}],"metrics":{},"references":[{"url":"https:\/\/blog.yulun.ac.cn\/posts\/2023\/fuzzing-mathtex\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51889","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.320","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Stack Overflow vulnerability in the validate() function in Mathtex v.1.05 and before allows a remote attacker to execute arbitrary code via crafted string in the application URL."},{"lang":"es","value":"Vulnerabilidad de desbordamiento de búfer en la región stack de la memoria en la función validar() en Mathtex v.1.05 y anteriores permite a un atacante remoto ejecutar código arbitrario a través de una cadena manipulada en la URL de la aplicación."}],"metrics":{},"references":[{"url":"https:\/\/blog.yulun.ac.cn\/posts\/2023\/fuzzing-mathtex\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-51890","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.380","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An infinite loop issue discovered in Mathtex 1.05 and before allows a remote attackers to consume CPU resources via crafted string in the application URL."},{"lang":"es","value":"Un problema de bucle infinito descubierto en Mathtex 1.05 y anteriores permite a atacantes remotos consumir recursos de CPU a través de una cadena manipulada en la URL de la aplicación."}],"metrics":{},"references":[{"url":"https:\/\/blog.yulun.ac.cn\/posts\/2023\/fuzzing-mathtex\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-52038","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.443","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue discovered in TOTOLINK X6000R v9.4.0cu.852_B20230719 allows attackers to run arbitrary commands via the sub_415C80 function."},{"lang":"es","value":"Un problema descubierto en TOTOLINK X6000R v9.4.0cu.852_B20230719 permite a atacantes ejecutar comandos arbitrarios a través de la función sub_415C80."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/Beckaf\/vunl\/blob\/main\/TOTOLINK\/X6000R\/1\/1.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-52039","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.500","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue discovered in TOTOLINK X6000R v9.4.0cu.852_B20230719 allows attackers to run arbitrary commands via the sub_415AA4 function."},{"lang":"es","value":"Un problema descubierto en TOTOLINK X6000R v9.4.0cu.852_B20230719 permite a atacantes ejecutar comandos arbitrarios a través de la función sub_415AA4."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/Beckaf\/vunl\/blob\/main\/TOTOLINK\/X6000R\/2\/2.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-52040","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.557","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue discovered in TOTOLINK X6000R v9.4.0cu.852_B20230719 allows attackers to run arbitrary commands via the sub_41284C function."},{"lang":"es","value":"Un problema descubierto en TOTOLINK X6000R v9.4.0cu.852_B20230719 permite a atacantes ejecutar comandos arbitrarios a través de la función sub_41284C."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/Beckaf\/vunl\/blob\/main\/TOTOLINK\/X6000R\/3\/3.md","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-22720","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T18:15:08.820","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Kanboard 1.2.34 is vulnerable to Html Injection in the group management feature."},{"lang":"es","value":"Kanboard 1.2.34 es vulnerable a la inyección HTML en la función de administración de grupos."}],"metrics":{},"references":[{"url":"https:\/\/cupc4k3.medium.com\/html-injection-vulnerability-in-kanboard-group-management-d9fe5154bb1b","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-23648","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T18:15:08.877","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Pimcore's Admin Classic Bundle provides a backend user interface for Pimcore. The password reset functionality sends to the the user requesting a password change an email containing an URL to reset its password. The URL sent contains a unique token, valid during 24 hours, allowing the user to reset its password. This token is highly sensitive ; as an attacker able to retrieve it would be able to resets the user's password. Prior to version 1.2.3, the reset-password URL is crafted using the \"Host\" HTTP header of the request sent to request a password reset. This way, an external attacker could send password requests for users, but specify a \"Host\" header of a website that they control. If the user receiving the mail clicks on the link, the attacker would retrieve the reset token of the victim and perform account takeover. Version 1.2.3 fixes this issue."},{"lang":"es","value":"El paquete Admin Classic de Pimcore proporciona una interfaz de usuario backend para Pimcore. La función de restablecimiento de contraseña envía al usuario que solicita un cambio de contraseña un correo electrónico que contiene una URL para restablecer su contraseña. La URL enviada contiene un token único, válido durante 24 horas, que permite al usuario restablecer su contraseña. Este token es muy sensible; ya que un atacante capaz de recuperarlo podría restablecer la contraseña del usuario. Antes de la versión 1.2.3, la URL de restablecimiento de contraseña se elabora utilizando el encabezado HTTP \"Host\" de la solicitud enviada para solicitar un restablecimiento de contraseña. De esta manera, un atacante externo podría enviar solicitudes de contraseña para los usuarios, pero especificar un encabezado \"Host\" de un sitio web que controla. Si el usuario que recibe el correo hace clic en el enlace, el atacante recuperará el token de reinicio de la víctima y realizará la apropiación de la cuenta. La versión 1.2.3 soluciona este problema."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:R\/S:U\/C:H\/I:H\/A:H","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"REQUIRED","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":8.8,"baseSeverity":"HIGH"},"exploitabilityScore":2.8,"impactScore":5.9}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Primary","description":[{"lang":"en","value":"CWE-74"}]}],"references":[{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/commit\/70f2205b5a5ea9584721d4f3e803f4d0dd5e4655","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/security\/advisories\/GHSA-mrqg-mwh7-q94j","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2024-23649","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T18:15:09.103","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Lemmy is a link aggregator and forum for the fediverse. Starting in version 0.17.0 and prior to version 0.19.1, users can report private messages, even when they're neither sender nor recipient of the message. The API response to creating a private message report contains the private message itself, which means any user can just iterate over message ids to (loudly) obtain all private messages of an instance. A user with instance admin privileges can also abuse this if the private message is removed from the response, as they're able to see the resulting reports.\n\nCreating a private message report by POSTing to `\/api\/v3\/private_message\/report` does not validate whether the reporter is the recipient of the message. lemmy-ui does not allow the sender to report the message; the API method should likely be restricted to accessible to recipients only. The API response when creating a report contains the `private_message_report_view` with all the details of the report, including the private message that has been reported:\n\nAny authenticated user can obtain arbitrary (untargeted) private message contents. Privileges required depend on the instance configuration; when registrations are enabled without application system, the privileges required are practically none. When registration applications are required, privileges required could be considered low, but this assessment heavily varies by instance.\n\nVersion 0.19.1 contains a patch for this issue. A workaround is available. If an update to a fixed Lemmy version is not immediately possible, the API route can be blocked in the reverse proxy. This will prevent anyone from reporting private messages, but it will also prevent exploitation before the update has been applied."},{"lang":"es","value":"Lemmy es un agregador de enlaces y un foro para la diversidad. A partir de la versión 0.17.0 y anteriores a la versión 0.19.1, los usuarios pueden reportar mensajes privados, incluso cuando no son ni el remitente ni el destinatario del mensaje. La respuesta de la API para crear un informe de mensajes privados contiene el mensaje privado en sí, lo que significa que cualquier usuario puede simplemente iterar sobre los ID de los mensajes para obtener (en voz alta) todos los mensajes privados de una instancia. Un usuario con privilegios de administrador de instancias también puede abusar de esto si el mensaje privado se elimina de la respuesta, ya que puede ver los informes resultantes. La creación de un informe de mensaje privado mediante PUBLICACIÓN en `\/api\/v3\/private_message\/report` no valida si el informante es el destinatario del mensaje. lemmy-ui no permite que el remitente informe el mensaje; Es probable que el método API deba estar restringido al acceso únicamente a los destinatarios. La respuesta de la API al crear un informe contiene `private_message_report_view` con todos los detalles del informe, incluido el mensaje privado que se ha informado: cualquier usuario autenticado puede obtener contenidos de mensajes privados arbitrarios (no dirigidos). Los privilegios necesarios dependen de la configuración de la instancia; cuando los registros se habilitan sin sistema de aplicación, los privilegios requeridos son prácticamente nulos. Cuando se requieren solicitudes de registro, los privilegios requeridos podrían considerarse bajos, pero esta evaluación varía mucho según el caso. La versión 0.19.1 contiene un parche para este problema. Hay una solución disponible. Si no es posible actualizar inmediatamente a una versión fija de Lemmy, la ruta API se puede bloquear en el proxy inverso. Esto evitará que alguien denuncie mensajes privados, pero también evitará la explotación antes de que se haya aplicado la actualización."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:H\/I:N\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"NONE","availabilityImpact":"NONE","baseScore":7.5,"baseSeverity":"HIGH"},"exploitabilityScore":3.9,"impactScore":3.6}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Primary","description":[{"lang":"en","value":"CWE-200"},{"lang":"en","value":"CWE-285"}]}],"references":[{"url":"https:\/\/github.com\/LemmyNet\/lemmy\/commit\/bc32b408b523b9b64aa57b8e47748f96cce0dae5","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/LemmyNet\/lemmy\/security\/advisories\/GHSA-r64r-5h43-26qv","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2024-23897","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.370","lastModified":"2024-01-25T10:15:08.073","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins 2.441 and earlier, LTS 2.426.2 and earlier does not disable a feature of its CLI command parser that replaces an '@' character followed by a file path in an argument with the file's contents, allowing unauthenticated attackers to read arbitrary files on the Jenkins controller file system."},{"lang":"es","value":"Jenkins 2.441 y anteriores, LTS 2.426.2 y anteriores no desactivan una función de su analizador de comandos CLI que reemplaza un carácter '@' seguido de una ruta de archivo en un argumento con el contenido del archivo, lo que permite a atacantes no autenticados leer archivos arbitrarios en el sistema de archivos del controlador Jenkins."}],"metrics":{},"references":[{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3314","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23898","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.420","lastModified":"2024-01-25T10:15:08.140","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins 2.217 through 2.441 (both inclusive), LTS 2.222.1 through 2.426.2 (both inclusive) does not perform origin validation of requests made through the CLI WebSocket endpoint, resulting in a cross-site WebSocket hijacking (CSWSH) vulnerability, allowing attackers to execute CLI commands on the Jenkins controller."},{"lang":"es","value":"Jenkins 2.217 a 2.441 (ambos incluida), LTS 2.222.1 a 2.426.2 (ambos incluida) no realizan la validación del origen de las solicitudes realizadas a través del endpoint CLI WebSocket, lo que genera una vulnerabilidad de secuestro de WebSocket entre sitios (CSWSH), lo que permite a los atacantes para ejecutar comandos CLI en el controlador Jenkins."}],"metrics":{},"references":[{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3315","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23899","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.467","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins Git server Plugin 99.va_0826a_b_cdfa_d and earlier does not disable a feature of its command parser that replaces an '@' character followed by a file path in an argument with the file's contents, allowing attackers with Overall\/Read permission to read content from arbitrary files on the Jenkins controller file system."},{"lang":"es","value":"El complemento del servidor Jenkins Git 99.va_0826a_b_cdfa_d y versiones anteriores no desactiva una función de su analizador de comandos que reemplaza un carácter '@' seguido de una ruta de archivo en un argumento con el contenido del archivo, permitiendo a atacantes con permiso general\/lectura leer contenido de archivos arbitrarios en el sistema de archivos del controlador Jenkins."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3319","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23900","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.523","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins Matrix Project Plugin 822.v01b_8c85d16d2 and earlier does not sanitize user-defined axis names of multi-configuration projects, allowing attackers with Item\/Configure permission to create or replace any config.xml files on the Jenkins controller file system with content not controllable by the attackers."},{"lang":"es","value":"El complemento Jenkins Matrix Project 822.v01b_8c85d16d2 y versiones anteriores no sanitiza los nombres de eje definidos por el usuario de proyectos de configuración múltiple, lo que permite a los atacantes con permiso Elemento\/Configurar crear o reemplazar cualquier archivo config.xml en el sistema de archivos del controlador Jenkins con contenido no controlable por los atacantes."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3289","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23901","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.563","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins GitLab Branch Source Plugin 684.vea_fa_7c1e2fe3 and earlier unconditionally discovers projects that are shared with the configured owner group, allowing attackers to configure and share a project, resulting in a crafted Pipeline being built by Jenkins during the next scan of the group."},{"lang":"es","value":"El complemento Jenkins GitLab Branch Source 684.vea_fa_7c1e2fe3 y anteriores descubre incondicionalmente proyectos que se comparten con el grupo propietario configurado, lo que permite a los atacantes configurar y compartir un proyecto, lo que da como resultado que Jenkins cree una canalización manipulada durante el siguiente análisis del grupo."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3040","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23902","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.610","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"A cross-site request forgery (CSRF) vulnerability in Jenkins GitLab Branch Source Plugin 684.vea_fa_7c1e2fe3 and earlier allows attackers to connect to an attacker-specified URL."},{"lang":"es","value":"Una vulnerabilidad de cross-site request forgery (CSRF) en el complemento Jenkins GitLab Branch Source 684.vea_fa_7c1e2fe3 y versiones anteriores permite a los atacantes conectarse a una URL especificada por el atacante."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3251","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23903","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.653","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins GitLab Branch Source Plugin 684.vea_fa_7c1e2fe3 and earlier uses a non-constant time comparison function when checking whether the provided and expected webhook token are equal, potentially allowing attackers to use statistical methods to obtain a valid webhook token."},{"lang":"es","value":"El complemento Jenkins GitLab Branch Source 684.vea_fa_7c1e2fe3 y versiones anteriores utiliza una función de comparación de tiempo no constante al verificar si el token de webhook proporcionado y el esperado son iguales, lo que potencialmente permite a los atacantes usar métodos estadísticos para obtener un token de webhook válido."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-2871","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23904","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.707","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins Log Command Plugin 1.0.2 and earlier does not disable a feature of its command parser that replaces an '@' character followed by a file path in an argument with the file's contents, allowing unauthenticated attackers to read content from arbitrary files on the Jenkins controller file system."},{"lang":"es","value":"Jenkins Log Command Plugin 1.0.2 y versiones anteriores no desactivan una función de su analizador de comandos que reemplaza un carácter '@' seguido de una ruta de archivo en un argumento con el contenido del archivo, permitiendo a atacantes no autenticados leer contenido de archivos arbitrarios en el sistema de archivos del controlador Jenkins."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3334","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2024-23905","sourceIdentifier":"jenkinsci-cert@googlegroups.com","published":"2024-01-24T18:15:09.750","lastModified":"2024-01-24T18:45:30.823","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Jenkins Red Hat Dependency Analytics Plugin 0.7.1 and earlier programmatically disables Content-Security-Policy protection for user-generated content in workspaces, archived artifacts, etc. that Jenkins offers for download."},{"lang":"es","value":"El complemento Jenkins Red Hat Dependency Analytics 0.7.1 y versiones anteriores deshabilita mediante programación la protección de la política de seguridad de contenido para el contenido generado por el usuario en espacios de trabajo, artefactos archivados, etc. que Jenkins ofrece para descargar."}],"metrics":{},"references":[{"url":"http:\/\/www.openwall.com\/lists\/oss-security\/2024\/01\/24\/6","source":"jenkinsci-cert@googlegroups.com"},{"url":"https:\/\/www.jenkins.io\/security\/advisory\/2024-01-24\/#SECURITY-3322","source":"jenkinsci-cert@googlegroups.com"}]}},{"cve":{"id":"CVE-2021-42145","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T19:15:08.420","lastModified":"2024-01-24T19:43:42.640","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An assertion failure discovered in in check_certificate_request() in Contiki-NG tinyDTLS through master branch 53a0d97 allows attackers to cause a denial of service."},{"lang":"es","value":"Un error de aserción descubierto en check_certificate_request() en Contiki-NG tinyDTLS a través de la rama maestra 53a0d97 permite a los atacantes provocar una denegación de servicio."}],"metrics":{},"references":[{"url":"https:\/\/seclists.org\/fulldisclosure\/2024\/Jan\/18","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2021-42146","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T19:15:08.483","lastModified":"2024-01-24T19:43:42.640","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue was discovered in Contiki-NG tinyDTLS through master branch 53a0d97. DTLS servers allow remote attackers to reuse the same epoch number within two times the TCP maximum segment lifetime, which is prohibited in RFC6347. This vulnerability allows remote attackers to obtain sensitive application (data of connected clients)."},{"lang":"es","value":"Se descubrió un problema en Contiki-NG tinyDTLS a través de la rama maestra 53a0d97. Los servidores DTLS permiten a atacantes remotos reutilizar el mismo número de época dentro de dos veces la vida útil máxima del segmento TCP, lo cual está prohibido en RFC6347. Esta vulnerabilidad permite a atacantes remotos obtener aplicaciones confidenciales (datos de clientes conectados)."}],"metrics":{},"references":[{"url":"https:\/\/seclists.org\/fulldisclosure\/2024\/Jan\/19","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2021-42147","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T19:15:08.530","lastModified":"2024-01-24T19:43:42.640","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Buffer over-read vulnerability in the dtls_sha256_update function in Contiki-NG tinyDTLS through master branch 53a0d97 allows remote attackers to cause a denial of service via crafted data packet."},{"lang":"es","value":"Vulnerabilidad de lectura excesiva del búfer en la función dtls_sha256_update en Contiki-NG tinyDTLS a través de la rama maestra 53a0d97 permite a atacantes remotos provocar una denegación de servicio a través de un paquete de datos manipulado."}],"metrics":{},"references":[{"url":"https:\/\/seclists.org\/fulldisclosure\/2024\/Jan\/20","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2021-43584","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T20:15:53.610","lastModified":"2024-01-25T01:59:45.643","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"DOM-based Cross Site Scripting (XSS vulnerability in 'Tail Event Logs' functionality in Nagios Nagios Cross-Platform Agent (NCPA) before 2.4.0 allows attackers to run arbitrary code via the name element when filtering for a log."},{"lang":"es","value":"Vulnerabilidad de Cross Site Scripting (XSS) basado en DOM en la funcionalidad 'Tail Event Logs' en Nagios Nagios Cross-Platform Agent (NCPA) anterior a 2.4.0 permite a los atacantes ejecutar código arbitrario a través del elemento de nombre al filtrar un registro."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/NagiosEnterprises\/ncpa\/issues\/830","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-23644","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T20:15:53.680","lastModified":"2024-01-25T01:59:45.643","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Trillium is a composable toolkit for building internet applications with async rust. In `trillium-http` prior to 0.3.12 and `trillium-client` prior to 0.5.4, insufficient validation of outbound header values may lead to request splitting or response splitting attacks in scenarios where attackers have sufficient control over headers. This only affects use cases where attackers have control of request headers, and can insert \"\\r\\n\" sequences. Specifically, if untrusted and unvalidated input is inserted into header names or values.\n\nOutbound `trillium_http::HeaderValue` and `trillium_http::HeaderName` can be constructed infallibly and were not checked for illegal bytes when sending requests from the client or responses from the server. Thus, if an attacker has sufficient control over header values (or names) in a request or response that they could inject `\\r\\n` sequences, they could get the client and server out of sync, and then pivot to gain control over other parts of requests or responses. (i.e. exfiltrating data from other requests, SSRF, etc.)\n\nIn `trillium-http` versions 0.3.12 and later, if a header name is invalid in server response headers, the specific header and any associated values are omitted from network transmission. Additionally, if a header value is invalid in server response headers, the individual header value is omitted from network transmission. Other headers values with the same header name will still be sent. In `trillium-client` versions 0.5.4 and later, if any header name or header value is invalid in the client request headers, awaiting the client Conn returns an `Error::MalformedHeader` prior to any network access. As a workaround, Trillium services and client applications should sanitize or validate untrusted input that is included in header values and header names. Carriage return, newline, and null characters are not allowed."},{"lang":"es","value":"Trillium es un conjunto de herramientas componibles para crear aplicaciones de Internet con óxido asíncrono. En `trillium-http` anterior a 0.3.12 y `trillium-client` anterior a 0.5.4, la validación insuficiente de los valores de encabezado salientes puede llevar a ataques de división de solicitudes o de división de respuestas en escenarios donde los atacantes tienen suficiente control sobre los encabezados. Esto solo afecta a los casos de uso en los que los atacantes tienen control de los encabezados de las solicitudes y pueden insertar secuencias \"\\r\\n\". Específicamente, si se inserta entrada que no es de confianza y no validada en nombres o valores de encabezado. Los `trillium_http::HeaderValue` y `trillium_http::HeaderName` salientes se pueden construir de manera infalible y no se verificaron en busca de bytes ilegales al enviar solicitudes del cliente o respuestas del servidor. Por lo tanto, si un atacante tiene suficiente control sobre los valores de encabezado (o nombres) en una solicitud o respuesta como para poder inyectar secuencias `\\r\\n`, podría desincronizar el cliente y el servidor y luego girar para obtener control sobre otras partes de solicitudes o respuestas. (es decir, filtrar datos de otras solicitudes, SSRF, etc.) En las versiones 0.3.12 y posteriores de `trillium-http`, si un nombre de encabezado no es válido en los encabezados de respuesta del servidor, el encabezado específico y cualquier valor asociado se omiten de la transmisión de red. Además, si un valor de encabezado no es válido en los encabezados de respuesta del servidor, el valor del encabezado individual se omite de la transmisión de la red. Se seguirán enviando otros valores de encabezado con el mismo nombre de encabezado. En las versiones 0.5.4 y posteriores de `trillium-client`, si algún nombre o valor de encabezado no es válido en los encabezados de solicitud del cliente, en espera, el cliente Conn devuelve un `Error::MalformedHeader` antes de cualquier acceso a la red. Como workaround, los servicios de Trillium y las aplicaciones cliente deben desinfectar o validar las entradas que no son de confianza incluidas en los valores y nombres de los encabezados. No se permiten caracteres de carriage return, nueva línea, ni nulos."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:L\/UI:N\/S:U\/C:H\/I:H\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"LOW","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"NONE","baseScore":6.8,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.6,"impactScore":5.2}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Primary","description":[{"lang":"en","value":"CWE-113"}]}],"references":[{"url":"https:\/\/github.com\/trillium-rs\/trillium\/commit\/16a42b3f8378a3fa4e61ece3e3e37e6a530df51d","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/trillium-rs\/trillium\/commit\/8d468f85e27b8d0943d6f43ce9f8c7397141a999","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/trillium-rs\/trillium\/security\/advisories\/GHSA-9f9p-cp3c-72jf","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2024-23646","sourceIdentifier":"security-advisories@github.com","published":"2024-01-24T20:15:53.877","lastModified":"2024-01-25T01:59:45.643","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"Pimcore's Admin Classic Bundle provides a backend user interface for Pimcore. The application allows users to create zip files from available files on the site. In the 1.x branch prior to version 1.3.2, parameter `selectedIds` is susceptible to SQL Injection. Any backend user with very basic permissions can execute arbitrary SQL statements and thus alter any data or escalate their privileges to at least admin level. Version 1.3.2 contains a fix for this issue.\n"},{"lang":"es","value":"El paquete Admin Classic de Pimcore proporciona una interfaz de usuario backend para Pimcore. La aplicación permite a los usuarios crear archivos zip a partir de archivos disponibles en el sitio. En la rama 1.x anterior a la versión 1.3.2, el parámetro `selectedIds` es susceptible a la inyección SQL. Cualquier usuario de backend con permisos muy básicos puede ejecutar declaraciones SQL arbitrarias y así alterar cualquier dato o escalar sus privilegios al menos al nivel de administrador. La versión 1.3.2 contiene una solución para este problema."}],"metrics":{"cvssMetricV31":[{"source":"security-advisories@github.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:L\/UI:N\/S:U\/C:H\/I:H\/A:H","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"LOW","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"HIGH","integrityImpact":"HIGH","availabilityImpact":"HIGH","baseScore":8.8,"baseSeverity":"HIGH"},"exploitabilityScore":2.8,"impactScore":5.9}]},"weaknesses":[{"source":"security-advisories@github.com","type":"Primary","description":[{"lang":"en","value":"CWE-89"}]}],"references":[{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/blob\/1.x\/src\/Controller\/Admin\/Asset\/AssetController.php#L2006","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/blob\/1.x\/src\/Controller\/Admin\/Asset\/AssetController.php#L2087","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/commit\/363afef29496cc40a8b863c2ca2338979fcf50a8","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/releases\/tag\/v1.3.2","source":"security-advisories@github.com"},{"url":"https:\/\/github.com\/pimcore\/admin-ui-classic-bundle\/security\/advisories\/GHSA-cwx6-4wmf-c6xv","source":"security-advisories@github.com"}]}},{"cve":{"id":"CVE-2023-24676","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T21:15:08.327","lastModified":"2024-01-25T01:59:45.643","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"An issue found in Processwire 3.0.210 allows attackers to execute arbitrary code and install a reverse shell via the download_zip_url parameter when installing a new module."},{"lang":"es","value":"Un problema encontrado en Processwire 3.0.210 permite a los atacantes ejecutar código arbitrario e instalar un shell inverso a través del parámetro download_zip_url al instalar un nuevo módulo."}],"metrics":{},"references":[{"url":"https:\/\/medium.com\/%40cupc4k3\/reverse-shell-via-remote-file-inlusion-in-proccesswire-cms-a8fa5ace3255","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-22751","sourceIdentifier":"cve@mitre.org","published":"2024-01-24T21:15:08.733","lastModified":"2024-01-25T01:59:45.643","vulnStatus":"Awaiting Analysis","descriptions":[{"lang":"en","value":"D-Link DIR-882 DIR882A1_FW130B06 was discovered to contain a stack overflow via the sub_477AA0 function."},{"lang":"es","value":"Se descubrió que D-Link DIR-882 DIR882A1_FW130B06 contenía un desbordamiento de búfer en la región stack de la memoria a través de la función sub_477AA0."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/5erua\/vuls\/blob\/main\/dir882.md","source":"cve@mitre.org"},{"url":"https:\/\/www.dlink.com\/en\/security-bulletin\/","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-0617","sourceIdentifier":"security@wordfence.com","published":"2024-01-25T02:15:53.067","lastModified":"2024-01-25T02:15:53.067","vulnStatus":"Received","descriptions":[{"lang":"en","value":"The Category Discount Woocommerce plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the wpcd_save_discount() function in all versions up to, and including, 4.12. This makes it possible for unauthenticated attackers to modify product category discounts that could lead to loss of revenue."},{"lang":"es","value":"El complemento Category Discount Woocommerce para WordPress es vulnerable a modificaciones no autorizadas de datos debido a una falta de verificación de capacidad en la función wpcd_save_discount() en todas las versiones hasta la 4.12 incluida. Esto hace posible que atacantes no autenticados modifiquen descuentos en categorías de productos que podrían provocar una pérdida de ingresos."}],"metrics":{"cvssMetricV31":[{"source":"security@wordfence.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:N\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":5.3,"baseSeverity":"MEDIUM"},"exploitabilityScore":3.9,"impactScore":1.4}]},"references":[{"url":"https:\/\/plugins.trac.wordpress.org\/browser\/woo-product-category-discount\/trunk\/cd-admin.php#L171","source":"security@wordfence.com"},{"url":"https:\/\/plugins.trac.wordpress.org\/changeset?sfp_email=&sfph_mail=&reponame=&old=3026242%40woo-product-category-discount&new=3026242%40woo-product-category-discount&sfp_email=&sfph_mail=","source":"security@wordfence.com"},{"url":"https:\/\/www.wordfence.com\/threat-intel\/vulnerabilities\/id\/996b44bb-d1e0-4f82-b8ee-a98b0ae994f9?source=cve","source":"security@wordfence.com"}]}},{"cve":{"id":"CVE-2024-0624","sourceIdentifier":"security@wordfence.com","published":"2024-01-25T02:15:53.243","lastModified":"2024-01-25T02:15:53.243","vulnStatus":"Received","descriptions":[{"lang":"en","value":"The Paid Memberships Pro – Content Restriction, User Registration, & Paid Subscriptions plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 2.12.7. This is due to missing or incorrect nonce validation on the pmpro_update_level_order() function. This makes it possible for unauthenticated attackers to update the order of levels via a forged request granted they can trick a site administrator into performing an action such as clicking on a link."},{"lang":"es","value":"El complemento Paid Memberships Pro – Content Restriction, User Registration, &amp; Paid Subscriptions para WordPress es vulnerable a Cross-Site Request Forgery en todas las versiones hasta la 2.12.7 incluida. Esto se debe a una validación nonce faltante o incorrecta en la función pmpro_update_level_order(). Esto hace posible que atacantes no autenticados actualicen el orden de los niveles a través de una solicitud falsificada, siempre que puedan engañar al administrador del sitio para que realice una acción como hacer clic en un enlace."}],"metrics":{"cvssMetricV31":[{"source":"security@wordfence.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:N\/S:U\/C:N\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":5.3,"baseSeverity":"MEDIUM"},"exploitabilityScore":3.9,"impactScore":1.4}]},"references":[{"url":"https:\/\/plugins.trac.wordpress.org\/browser\/paid-memberships-pro\/trunk\/includes\/services.php#L139","source":"security@wordfence.com"},{"url":"https:\/\/plugins.trac.wordpress.org\/changeset\/3025164\/paid-memberships-pro\/tags\/2.12.8\/includes\/services.php","source":"security@wordfence.com"},{"url":"https:\/\/www.wordfence.com\/threat-intel\/vulnerabilities\/id\/ae68d083-b6e2-409b-8c91-d4eb7e62dba9?source=cve","source":"security@wordfence.com"}]}},{"cve":{"id":"CVE-2024-0688","sourceIdentifier":"security@wordfence.com","published":"2024-01-25T02:15:53.417","lastModified":"2024-01-25T02:15:53.417","vulnStatus":"Received","descriptions":[{"lang":"en","value":"The \"WebSub (FKA. PubSubHubbub)\" plugin for WordPress is vulnerable to Stored Cross-Site Scripting via plugin settings in all versions up to, and including, 3.1.4 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with administrator-level permissions and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."},{"lang":"es","value":"El complemento \"WebSub (FKA. PubSubHubbub)\" para WordPress es vulnerable a Cross-Site Scripting Almacenado a través de la configuración del complemento en todas las versiones hasta la 3.1.4 incluida debido a una sanitización de entrada y un escape de salida insuficientes. Esto hace posible que atacantes autenticados, con permisos de nivel de administrador y superiores, inyecten scripts web arbitrarios en páginas que se ejecutarán cada vez que un usuario acceda a una página inyectada."}],"metrics":{"cvssMetricV31":[{"source":"security@wordfence.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:H\/UI:N\/S:C\/C:L\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":4.4,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.3,"impactScore":2.7}]},"references":[{"url":"https:\/\/plugins.trac.wordpress.org\/changeset?sfp_email=&sfph_mail=&reponame=&old=3024228%40pubsubhubbub&new=3024228%40pubsubhubbub&sfp_email=&sfph_mail=","source":"security@wordfence.com"},{"url":"https:\/\/www.wordfence.com\/threat-intel\/vulnerabilities\/id\/f07b166b-3436-4797-a2df-096ff7c27a09?source=cve","source":"security@wordfence.com"}]}},{"cve":{"id":"CVE-2024-0625","sourceIdentifier":"security@wordfence.com","published":"2024-01-25T03:15:07.753","lastModified":"2024-01-25T03:15:07.753","vulnStatus":"Received","descriptions":[{"lang":"en","value":"The WPFront Notification Bar plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the ‘wpfront-notification-bar-options[custom_class]’ parameter in all versions up to, and including, 3.3.2 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with administrator-level access, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page. This only affects multi-site installations and installations where unfiltered_html has been disabled."},{"lang":"es","value":"El complemento WPFront Notification Bar para WordPress es vulnerable a Cross-Site Scripting Almacenado a través del parámetro 'wpfront-notification-bar-options[custom_class]' en todas las versiones hasta la 3.3.2 incluida debido a una sanitización de entrada insuficiente y un escape de salida . Esto hace posible que atacantes autenticados, con acceso a nivel de administrador, inyecten scripts web arbitrarios en páginas que se ejecutarán cada vez que un usuario acceda a una página inyectada. Esto solo afecta a las instalaciones multisitio y a las instalaciones en las que se ha deshabilitado unfiltered_html."}],"metrics":{"cvssMetricV31":[{"source":"security@wordfence.com","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:H\/UI:N\/S:C\/C:L\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"LOW","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":4.4,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.3,"impactScore":2.7}]},"references":[{"url":"https:\/\/plugins.trac.wordpress.org\/browser\/wpfront-notification-bar\/trunk\/templates\/template-wpfront-notification-bar.php#L94","source":"security@wordfence.com"},{"url":"https:\/\/plugins.trac.wordpress.org\/changeset?sfp_email=&sfph_mail=&reponame=&old=3025472%40wpfront-notification-bar&new=3025472%40wpfront-notification-bar&sfp_email=&sfph_mail=","source":"security@wordfence.com"},{"url":"https:\/\/www.wordfence.com\/threat-intel\/vulnerabilities\/id\/19a5a9f3-637c-42af-9775-5651a14cf516?source=cve","source":"security@wordfence.com"}]}},{"cve":{"id":"CVE-2024-23985","sourceIdentifier":"cve@mitre.org","published":"2024-01-25T05:15:08.370","lastModified":"2024-01-25T05:15:08.370","vulnStatus":"Received","descriptions":[{"lang":"en","value":"EzServer 6.4.017 allows a denial of service (daemon crash) via a long string, such as one for the RNTO command."},{"lang":"es","value":"EzServer 6.4.017 permite una denegación de servicio (caída del daemon) a través de una cadena larga, como la del comando RNTO."}],"metrics":{},"references":[{"url":"https:\/\/packetstormsecurity.com\/files\/176663\/EzServer-6.4.017-Denial-Of-Service.html","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-50785","sourceIdentifier":"cve@mitre.org","published":"2024-01-25T06:15:50.533","lastModified":"2024-01-25T06:15:50.533","vulnStatus":"Received","descriptions":[{"lang":"en","value":"Zoho ManageEngine ADAudit Plus before 7270 allows admin users to view names of arbitrary directories via path traversal."},{"lang":"es","value":"Zoho ManageEngine ADAudit Plus anterior a 7270 permite a los usuarios administradores ver nombres de directorios arbitrarios mediante path traversal."}],"metrics":{},"references":[{"url":"https:\/\/www.manageengine.com\/products\/active-directory-audit\/cve-2023-50785.html","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2024-22099","sourceIdentifier":"security@openanolis.org","published":"2024-01-25T07:15:08.697","lastModified":"2024-01-25T07:15:08.697","vulnStatus":"Received","descriptions":[{"lang":"en","value":"NULL Pointer Dereference vulnerability in Linux Linux kernel kernel on Linux, x86, ARM (net, bluetooth modules) allows Overflow Buffers. This vulnerability is associated with program files \/net\/bluetooth\/rfcomm\/core.C.\n\nThis issue affects Linux kernel: v2.6.12-rc2.\n\n"},{"lang":"es","value":"Vulnerabilidad de desreferencia de puntero NULL en el kernel de Linux en Linux, x86, ARM (módulos de red, bluetooth) permite desbordamiento de búferes. Esta vulnerabilidad está asociada con los archivos de programa \/net\/bluetooth\/rfcomm\/core.C. Este problema afecta al kernel de Linux: v2.6.12-rc2."}],"metrics":{"cvssMetricV31":[{"source":"security@openanolis.org","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:L\/UI:N\/S:C\/C:N\/I:N\/A:H","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"LOW","userInteraction":"NONE","scope":"CHANGED","confidentialityImpact":"NONE","integrityImpact":"NONE","availabilityImpact":"HIGH","baseScore":6.3,"baseSeverity":"MEDIUM"},"exploitabilityScore":1.8,"impactScore":4.0}]},"weaknesses":[{"source":"security@openanolis.org","type":"Secondary","description":[{"lang":"en","value":"CWE-476"}]}],"references":[{"url":"https:\/\/bugzilla.openanolis.cn\/show_bug.cgi?id=7956","source":"security@openanolis.org"}]}},{"cve":{"id":"CVE-2024-23307","sourceIdentifier":"security@openanolis.org","published":"2024-01-25T07:15:09.940","lastModified":"2024-01-25T07:15:09.940","vulnStatus":"Received","descriptions":[{"lang":"en","value":"Integer Overflow or Wraparound vulnerability in Linux Linux kernel kernel on Linux, x86, ARM (md, raid, raid5 modules) allows Forced Integer Overflow."},{"lang":"es","value":"Desbordamiento de enteros o vulnerabilidad Wraparound en el kernel de Linux en Linux, x86, ARM (módulos md, raid, raid5) permite el desbordamiento de enteros forzado."}],"metrics":{"cvssMetricV31":[{"source":"security@openanolis.org","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:H\/PR:H\/UI:N\/S:U\/C:N\/I:N\/A:H","attackVector":"NETWORK","attackComplexity":"HIGH","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"NONE","availabilityImpact":"HIGH","baseScore":4.4,"baseSeverity":"MEDIUM"},"exploitabilityScore":0.7,"impactScore":3.6}]},"weaknesses":[{"source":"security@openanolis.org","type":"Secondary","description":[{"lang":"en","value":"CWE-190"}]}],"references":[{"url":"https:\/\/bugzilla.openanolis.cn\/show_bug.cgi?id=7975","source":"security@openanolis.org"}]}},{"cve":{"id":"CVE-2023-33757","sourceIdentifier":"cve@mitre.org","published":"2024-01-25T08:15:08.420","lastModified":"2024-01-25T08:15:08.420","vulnStatus":"Received","descriptions":[{"lang":"en","value":"A lack of SSL certificate validation in Splicecom iPCS (iOS App) v1.3.4, iPCS2 (iOS App) v2.8 and before, and iPCS (Android App) v1.8.5 and before allows attackers to eavesdrop on communications via a man-in-the-middle attack."},{"lang":"es","value":"La falta de validación del certificado SSL en Splicecom iPCS (iOS App) v1.3.4, iPCS2 (iOS App) v2.8 y anteriores, e iPCS (Android App) v1.8.5 y anteriores permite a los atacantes espiar las comunicaciones a través de un ataque de man-in-the-middle."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/twignet\/splicecom","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-33758","sourceIdentifier":"cve@mitre.org","published":"2024-01-25T08:15:08.573","lastModified":"2024-01-25T08:15:08.573","vulnStatus":"Received","descriptions":[{"lang":"en","value":"Splicecom Maximiser Soft PBX v1.5 and before was discovered to contain a cross-site scripting (XSS) vulnerability via the CLIENT_NAME and DEVICE_GUID fields in the login component."},{"lang":"es","value":"Se descubrió que Splicecom Maximiser Soft PBX v1.5 y anteriores contenía una vulnerabilidad de Cross-Site Scripting (XSS) a través de los campos CLIENT_NAME y DEVICE_GUID en el componente de inicio de sesión."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/twignet\/splicecom","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-33759","sourceIdentifier":"cve@mitre.org","published":"2024-01-25T08:15:08.637","lastModified":"2024-01-25T08:15:08.637","vulnStatus":"Received","descriptions":[{"lang":"en","value":"SpliceCom Maximiser Soft PBX v1.5 and before does not restrict excessive authentication attempts, allowing attackers to bypass authentication via a brute force attack."},{"lang":"es","value":"SpliceCom Maximiser Soft PBX v1.5 y anteriores no restringe los intentos de autenticación excesivos, lo que permite a los atacantes eludir la autenticación mediante un ataque de fuerza bruta."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/twignet\/splicecom","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-33760","sourceIdentifier":"cve@mitre.org","published":"2024-01-25T08:15:08.707","lastModified":"2024-01-25T08:15:08.707","vulnStatus":"Received","descriptions":[{"lang":"en","value":"SpliceCom Maximiser Soft PBX v1.5 and before was discovered to utilize a default SSL certificate. This issue can allow attackers to eavesdrop on communications via a man-in-the-middle attack."},{"lang":"es","value":"Se descubrió que SpliceCom Maximiser Soft PBX v1.5 y anteriores utiliza un certificado SSL predeterminado. Este problema puede permitir a los atacantes espiar las comunicaciones mediante un ataque de man-in-the-middle."}],"metrics":{},"references":[{"url":"https:\/\/github.com\/twignet\/splicecom","source":"cve@mitre.org"}]}},{"cve":{"id":"CVE-2023-6282","sourceIdentifier":"cve-coordination@incibe.es","published":"2024-01-25T12:15:45.917","lastModified":"2024-01-25T12:15:45.917","vulnStatus":"Received","descriptions":[{"lang":"en","value":"IceHrm 23.0.0.OS does not sufficiently encode user-controlled input, which creates a Cross-Site Scripting (XSS) vulnerability via \/icehrm\/app\/fileupload_page.php, in multiple parameters. An attacker could exploit this vulnerability by sending a specially crafted JavaScript payload and partially hijacking the victim's browser."},{"lang":"es","value":"IceHrm 23.0.0.OS no codifica suficientemente la entrada controlada por el usuario, lo que crea una vulnerabilidad de Cross-Site Scripting (XSS) a través de \/icehrm\/app\/fileupload_page.php, en múltiples parámetros. Un atacante podría aprovechar esta vulnerabilidad enviando un payload de JavaScript especialmente manipulado y secuestrando parcialmente el navegador de la víctima."}],"metrics":{"cvssMetricV31":[{"source":"cve-coordination@incibe.es","type":"Secondary","cvssData":{"version":"3.1","vectorString":"CVSS:3.1\/AV:N\/AC:L\/PR:N\/UI:R\/S:U\/C:L\/I:L\/A:N","attackVector":"NETWORK","attackComplexity":"LOW","privilegesRequired":"NONE","userInteraction":"REQUIRED","scope":"UNCHANGED","confidentialityImpact":"LOW","integrityImpact":"LOW","availabilityImpact":"NONE","baseScore":5.4,"baseSeverity":"MEDIUM"},"exploitabilityScore":2.8,"impactScore":2.5}]},"weaknesses":[{"source":"cve-coordination@incibe.es","type":"Primary","description":[{"lang":"en","value":"CWE-79"}]}],"references":[{"url":"https:\/\/www.incibe.es\/en\/incibe-cert\/notices\/aviso\/cross-site-scripting-vulnerability-icehrm","source":"cve-coordination@incibe.es"}]}}]}